# تمرین‌های لیست

# ایجاد لیست تو در تو:
# یک لیست تو در تو ایجاد کنید که شامل چندین لیست دیگر باشد و سپس به عناصر داخلی آن دسترسی پیدا کنید.



x = [[1,2], [1,2,3,4]]
print(x[0][0])
print(x[0][1])
print(x[1][0])
print(x[1][1])
print(x[1][2])
print(x[1][3])
z = x[0][0] + x[0][1] + x[1][0] + x[1][1] + x[1][2] + x[1][3]
print(z)







# فیلتر کردن لیست:
# یک لیست از اعداد ایجاد کنید و سپس تمام اعداد زوج را از آن فیلتر کنید و در یک لیست جدید ذخیره کنید.

# ترکیب دو لیست:
# دو لیست از اعداد ایجاد کنید و سپس آن‌ها را به گونه‌ای ترکیب کنید که عناصر لیست دوم به ترتیب در بین عناصر لیست اول قرار گیرند.

# محاسبه میانگین لیست:
# یک لیست از اعداد ایجاد کنید و میانگین آن‌ها را محاسبه کنید.

# تمرین‌های تاپل

# تبدیل لیست به تاپل و بالعکس:
# یک لیست ایجاد کنید و آن را به تاپل تبدیل کنید. سپس تاپل را به لیست تبدیل کنید.
# یافتن بیشترین و کمترین مقدار در تاپل:
# یک تاپل از اعداد ایجاد کنید و بیشترین و کمترین مقدار را در آن پیدا کنید.
# تاپل‌های تو در تو:
# یک تاپل تو در تو ایجاد کنید که شامل چندین تاپل دیگر باشد و سپس به عناصر داخلی آن دسترسی پیدا کنید.
# تبدیل تاپل به رشته:
# یک تاپل از کاراکترها ایجاد کنید و آن را به یک رشته تبدیل کنید.
